In [ ]:
#!pip install flask

In [1]:
from flask import Flask

In [2]:
# from sklearn.linear_model import LinearRegression
# #------------------------------------------------------------------

# reg = LinearRegression()
# # Creating the instance of Linear Regression class

# reg.fit(X,y)
# # To use any method that is available in Lr class

# This is just for your refernce

In [3]:
# Intialiaze the flask in the same way like we intialise the LR class
app = Flask(__name__) #dir struct ir required __name__ take care of the struct

# now we can use any functionality of app 

@app.route("/")
def homepage():
    return "AKASH we are enjoying the session"

app.run()

 * Serving Flask app '__main__' (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://127.0.0.1:5000/ (Press CTRL+C to quit)
127.0.0.1 - - [30/Oct/2022 11:46:00] "GET / HTTP/1.1" 200 -
127.0.0.1 - - [30/Oct/2022 11:52:37] "GET / HTTP/1.1" 200 -

In [4]:
print("hello")

hello

In [7]:
# Intialiaze the flask in the same way like we intialise the LR class
app = Flask(__name__) #dir struct ir required __name__ take care of the struct

# now we can use any functionality of app 

@app.route("/<name>")
def homepage(name):
    return "<html><h1>Welcome "+name+ " to the session"

app.run()

 * Serving Flask app '__main__' (lazy loading)
 * Environment: production
   WARNING: This is a development server. Do not use it in a production deployment.
   Use a production WSGI server instead.
 * Debug mode: off

 * Running on http://127.0.0.1:5000/ (Press CTRL+C to quit)
127.0.0.1 - - [30/Oct/2022 12:14:56] "GET /divyanshu HTTP/1.1" 200 -
127.0.0.1 - - [30/Oct/2022 12:15:03] "GET /thang HTTP/1.1" 200 -
127.0.0.1 - - [30/Oct/2022 12:18:06] "GET /thang HTTP/1.1" 200 -
127.0.0.1 - - [30/Oct/2022 12:18:11] "GET /Gaju HTTP/1.1" 200 -

# Machine Learning Model

In [1]:
import pandas as pd
df = pd.read_csv("../hiring.csv")

In [2]:
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [3]:
df.shape

(8, 4)

In [4]:
df.columns = ['experience', 'test_score', 'interview_score','salary']
df.head()

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [5]:
df.isnull().sum()

experience         2
test_score         1
interview_score    0
salary             0
dtype: int64

In [6]:
df.experience.fillna(0,inplace=True)
df.test_score.fillna(df.test_score.mean(),inplace=True)

In [7]:
df.isnull().sum()

experience         0
test_score         0
interview_score    0
salary             0
dtype: int64

In [8]:
df

  experience  test_score  interview_score  salary
0          0    8.000000                9   50000
1          0    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000

In [9]:
d={
    "five":5,
    "two":2,
    "seven":7,
    "three":3,
    'ten':10,
    "eleven":11,
    0:0
}
df.experience = df.experience.apply(lambda x:d[x])

In [10]:
df

   experience  test_score  interview_score  salary
0           0    8.000000                9   50000
1           0    8.000000                6   45000
2           5    6.000000                7   60000
3           2   10.000000               10   65000
4           7    9.000000                6   70000
5           3    7.000000               10   62000
6          10    7.857143                7   72000
7          11    7.000000                8   80000

In [11]:
X = df.iloc[:,:-1]
y = df.iloc[:,-1]

In [12]:
from sklearn.linear_model import LinearRegression
reg = LinearRegression()

In [13]:
reg.fit(X,y)

LinearRegression()

In [14]:
reg.predict([[3,4,2]])

array([37765.9351935])

In [15]:
import pickle
pickle.dump(reg,open("lr_c38.pkl","wb"))

In [1]:
reg.predict([[3,4,2]])

NameError: name 'reg' is not defined

In [1]:
import pickle
reg = pickle.load(open("lr_c38.pkl","rb"))

In [2]:
reg.predict([[3,4,2]])

array([37765.9351935])

In [ ]:
array([37765.9351935])
       37765.93519350272